; domain
(define (domain block-words)
  (:requirements :strips :typing :equality)
  (:types block)
  (:predicates (on ?x ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y - block)
	     :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y)))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty) (not (= ?x ?y)))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem block-words)
	(:domain block-words)
	(:objects
		a i s e f l n b m - block
	)
	(:init
		(handempty)
		(clear m)
		(on m a)
		(on a i)
		(ontable i)
		(clear f)
		(on f s)
		(ontable s)
		(clear e)
		(ontable e)
		(clear l)
		(on l b)
		(on b n)
		(ontable n)
	)
	(:goal (and
		;; flame
		(clear f) (ontable e) (on f l) (on l a) (on a m) (on m e)
	))
)

; plan
1. (unstack m a)
   deleted: (clear m) (handempty) (on m a)
   added: (holding m) (clear a)
   goals met: 2 of 6
2. (stack m e)
   deleted: (holding m) (clear e)
   added: (clear m) (handempty) (on m e)
   goals met: 3 of 6
3. (unstack a i)
   deleted: (clear a) (handempty) (on a i)
   added: (holding a) (clear i)
   goals met: 3 of 6
4. (stack a m)
   deleted: (holding a) (clear m)
   added: (clear a) (handempty) (on a m)
   goals met: 4 of 6
5. (unstack l b)
   deleted: (clear l) (handempty) (on l b)
   added: (holding l) (clear b)
   goals met: 4 of 6
6. (stack l a)
   deleted: (holding l) (clear a)
   added: (clear l) (handempty) (on l a)
   goals met: 5 of 6
7. (unstack f s)
   deleted: (clear f) (handempty) (on f s)
   added: (holding f) (clear s)
   goals met: 4 of 6
8. (stack f l)
   deleted: (holding f) (clear l)
   added: (clear f) (handempty) (on f l)
   goals met: 6 of 6
